import type { NextPage } from "next";
import { useRef, useState } from "react";
import { motion } from "framer-motion";
import { useRouter } from "next/router";
import clsx from "clsx";

const Card = (props: { onClick: () => void; time: string; desc: string }) => {
  const router = useRouter();
  const isSelected = router.query.period === props.time;
  const [time, el] = props.time.split("π.Χ.");
  return (
    <motion.button
      transition={{ duration: 0.6 }}
      animate={{
        width: isSelected ? 550 : 80,
      }}
      onClick={props.onClick}
      className={clsx(
        "select-none transition border-r items-center  duration-200 border-white text-white border-opacity-25 relative h-40 hover:bg-cyan-800  hover:text-black  bg-black",
        {
          "bg-cyan-600": isSelected,
        }
      )}
    >
      <div
        className={
          " text-white overflow-hidden w-full p-2 font-black bg-opacity-40 h-full"
        }
      >
        <motion.div
          className={clsx("whitespace-nowrap", {
            "flex w-full justify-center items-center": isSelected,
          })}
          transition={{ duration: 0.45 }}
          animate={{
            rotate: isSelected ? 0 : 90,
            translateY: isSelected ? 0 : 30,
          }}
        >
          <div className={clsx(isSelected ? "text-3xl" : "text-base ")}>
            {time}π.Χ.
          </div>
          <div className={clsx(isSelected ? "text-xl ml-2 " : "text-xs")}>
            {el.replace("-", "")}
          </div>
        </motion.div>

        {isSelected && (
          <div className="my-2 border-b border border-white border-opacity-5" />
        )}
        <motion.div
          transition={{ duration: 0.6, delay: 0.2 }}
          animate={{
            translateY: isSelected ? 0 : -150,
            opacity: isSelected ? 1 : 0,
          }}
        >
          <div className="whitespace-normal">{props.desc}</div>
        </motion.div>
      </div>
    </motion.button>
  );
};

const timeLine = [
  {
    title: "550 π.Χ.",
    subtitle: "Ο Κύρος Β΄ (ο Μέγας)",
    desc: "Ο Κύρος Β΄ (ο Μέγας) καταλύει το κράτος των Μήδων στους οποίους ο λαός του, οι Πέρσες ήταν υποτελείς, δημιουργώντας ένα ανεξάρτητο βασίλειο.",
    img: "1.png",
    Μέγεθος: "316 x 569",
  },
  {
    title: "547 π.Χ.",
    subtitle: "Υποταγή Λυδίας",
    desc: "Ο Κύρος Β΄ υποτάσσει το βασίλειο της Λυδίας υπό τον βασιλιά Κροίσο, το οποίο βρίσκεται στη δυτική Μικρά Ασία. Μαζί με αυτό, υποτάσσονται στον Πέρση βασιλέα και οι ελληνικές πόλεις των δυτικών παραλίων της Μικράς Ασίας, κτήσεις προηγουμένως της Λυδίας. Μαζί με αυτές υποτάσσονται τα νησιά του Αιγαίου στα ανοιχτά της μικρασιατικής παραλίας και η Φοινίκη.",
    img: "2.png",
    Μέγεθος: "421 x 420",
  },
  {
    title: "540 - 539 π.Χ.",
    subtitle: "Κατάλυση Βαβυλώνας",
    desc: "Ο Κύρος Β΄ καταλύει τη Βαβυλώνα, το τελευταίο μεγάλο ανεξάρτητο βασίλειο της Ανατολής.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "538 - 530 π.Χ.",
    subtitle: "Ολοκλήρωση της περσικής κατάκτησης",
    desc: "Ο Κύρος Β΄ υποτάσσει το σύνολο της υπόλοιπης Ανατολής.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "529 π.Χ.",
    subtitle: "Αλλαγή εξουσίας στην Περσία",
    desc: "Θάνατος του Κύρου. Τον διαδέχεται ο γιος του Καμβύσης.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "525 - 523 π.Χ.",
    subtitle: "Η Περσία εξαπλώνεται προς τα δυτικά",
    desc: "Ο Καμβύσης συνεχίζει τις κατακτήσεις. Η Κύπρος, η Αίγυπτος και η Κυρηναϊκή περνούν στην περσική κυριαρχία.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "522 π.Χ.",
    subtitle: "Αναταραχές στην περσική αυτοκρατορία",
    desc: "Ξαφνικός θάνατος του Καμβύση. Δυναστικές συγκρούσεις και άνοδος του Δαρείου Α΄ στον θρόνο. Παρουσιάζεται ως συγγενής του Κύρου Β΄ μέσω ενός κοινού τους προγόνου, του Αχαιμένη. Από τότε η αυτοκρατορία των Περσών ονομάζεται Αχαιμενιδική.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "513 π.Χ.",
    subtitle: "Οι Πέρσες στην Ευρώπη",
    desc: "Ο Δαρείος Α΄ εκστρατεύει στη Θράκη, όντας ο πρώτος ηγεμόνας της Ανατολής που δραστηριοποιείται στρατιωτικά σε ευρωπαϊκό έδαφος.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "512 π.Χ.",
    subtitle: "Η σατραπεία της Θράκης",
    desc: "Παρά την υποχώρηση του Δαρείου και την ήττα του στη Σκυθία πέρα από τον Ίστρο (σημ. Δούναβη), δημιουργείται η σατραπεία της Θράκης , την υποταγή όλων των ελληνικών πόλεων της περιοχής ( Βυζάντιο, Χαλκηδόνα Άντανδρο, Λαμπώνιο και τα νησιά Λήμνος και Ίμβρος) αλλά και του βασιλείου της Μακεδονίας. Τα σύνορα της αυτοκρατορίας των Αχαιμενιδών φτάνουν πλέον στον Ίστρο και τον Στρυμόνα.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "499 - 494 π.Χ.",
    subtitle: "Ιωνική επανάσταση",
    desc: 'Οι ιωνικές ελληνικές πόλεις της δυτικής Μικράς Ασίας εξεγείρονται εναντίον των Περσών. Στη συνδρομή που ζήτησαν από τους Έλληνες της κυρίως Ελλάδας ανταποκρίθηκαν η Αθήνα και Ερέτρια. Το εκστρατευτικό σώμα των Αθηναίων κατάφερε να καταλάβει και να πυρπολήσει τις Σάρδεις, το κέντρο διοίκησης των Περσών στην ευρύτερη περιοχή της Μικράς Ασίας.\nΚατά τον Ηρόδοτο, η αθηναϊκή συμμετοχή στην εξέγερση των Ιώνων υπήρξε η αιτία των Μηδικών πολέμων. Νεότεροι ιστορικοί, ωστόσο, έδωσαν μεγαλύτερη έμφαση στην επεκτατική φιλοδοξία του Μεγάλου Βασιλέα και στην επιθυμία του να αποκλείσει μία νέα εξέγερση, εξουδετερώνοντας τις πόλεις της κυρίως Ελλάδας που βοήθησαν τους Ίωνες. Τελευταία, από ορισμένους μελετητές έχει δοθεί περισσότερη έμφαση στις δολοπλοκίες των Ελλήνων που είχαν καταφύγει στην περσική αυλή και υπέθαλψαν την περσική επιθετικότητα για προσωπικό τους όφελος. Η τελική άρνηση των Αθηναίων και των Σπαρτιατών να δώσουν "γην και ύδωρ" στους πρέσβεις των Περσών προκάλεσε την εισβολή του 490 π.Χ., η οποία κατέληξε στη μάχη του Μαραθώνα.',
    img: "10.png",
    Μέγεθος: "554 x 384",
  },
  {
    title: "493 π.Χ.",
    subtitle: "Το τέλος των αναταραχών",
    desc: "Οριστική καταστολή της εξέγερσης από τους Πέρσες.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "492 π.Χ.",
    subtitle: "Η επανεμφάνιση των Περσών στη Θράκη",
    desc: "Ο Πέρσης στρατηγός Μαρδόνιος εκστρατεύει στη Θράκη. Αποκαθιστά την περσική εξουσία στη Θάσο και τη Μακεδονία. Όμως ένα μεγάλο μέρος του στόλου του καταστρέφεται από τρικυμία στα ανοιχτά του όρους Άθω και η εκστρατεία τερματίζεται. Ο Αθηναίος τύραννος της Χερσονήσου Μιλτιάδης επιστρέφει στην Αθήνα διωγμένος από τους Πέρσες.",
    img: "12.png",
    Μέγεθος: "284 x  224",
  },
  {
    title: "491 π.Χ.",
    subtitle: "Αρχή του πολέμου",
    desc: "Ο Δαρείος στελνει απεσταλμένους στις ελληνικές πόλεις ζητώντας υποταγή. Αν και η Αθήνα και η Σπάρτη αρνούνται σθεναρά, άλλες πόλεις, όπως η Αίγινα δέχονται την υποταγή.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "490 π.Χ. - Άνοιξη",
    subtitle: "1ος Μηδικός πόλεμος",
    desc: "Άφιξη του περσικού στόλου στο Αιγαίο πέλαγος υπό τους Δάτη και Αρταφέρνη. Την εκστρατεία συνοδεύει και ο εξόριστος τύραννος των Αθηνών Ιππίας. Ο βασιλέας της Σπάρτης Κλεομένης επεμβαίνει μετά από αίτημα της Αθήνας στην Αίγινα και αποτρέπει την υποταγή της στους Πέρσες.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "490 π.Χ. - Καλοκαίρι",
    subtitle: "Οι πρώτες περσικές επιτυχίες",
    desc: "Ο περσικός στόλος πολιορκεί και καταλαμβάνει τη Νάξο. Δείχνει σεβασμό στο θρησκευτικό κέντρο των Ιώνων, τη Δήλο. Καταλαμβάνει την Κάρυστο. Ακολουθεί η πολιορκία και η κατάληψη μετά από προδοσία της Ερέτριας στην Εύβοια. Ως αντίποινα για τη συμμετοχή της στην Ιωνική Εξέγερση του 499 η πόλη καταστρέφεται.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "490 π.Χ. - Σεπτέμβριος",
    subtitle: "Μαραθώνας",
    desc: "Περσική απόβαση στον Μαραθώνα και πάλι ως αντίποινα για τη συμμετοχή της Αθήνας στην Ιωνική εξέγερση. Νίκη Αθηναίων και Πλαταιών. Οι Αθηναίοι έχουν ως επικεφαλής στρατηγό τον διωγμένο από την Χερσόνησο Μιλτιάδη. Αποτυχία των Περσών να καταλάβουν το Φάληρο. \nΑπό άποψη στρατηγικής η πεδιάδα του Μαραθώνα, αν και ευνοούσε το περσικό ιππικό, επέτρεπε συγχρόνως και την ανάπτυξη της αθηναϊκής φάλαγγας, που έδωσε στους Έλληνες την τελική νίκη. Μετά την πρώτη επίθεση των Περσών, το κέντρο της παράταξης των Αθηναίων αρχικά υποχώρησε. Οι πλευρικές δυνάμεις, όμως, των Ελλήνων περικύκλωσαν το κέντρο και ανέτρεψαν την αρνητική πορεία της μάχης. Οι Πέρσες προβάλλοντας ισχυρή αντίσταση υποχώρησαν προς την παραλία και αποβιβάστηκαν στα πλοία που απειλούσαν να τα κάψουν οι Έλληνες. Οι Πέρσες παρά τις απώλειές τους κατευθύνθηκαν στο Φάληρο, με σκοπό να αποβιβαστούν, πριν επιστρέψουν οι Αθηναίοι. Καθώς ο Μιλτιάδης, όμως, πρόλαβε να φτάσει στην Αθήνα πριν τη δύση του ηλίου και να παρατάξει το στρατό του στην πεδιάδα του Φαλήρου, ο περσικός στόλος αποχώρησε.",
    img: "16.png",
    Μέγεθος: "554 x 649",
  },
  {
    title: "490 π.Χ. - Φθινόπωρο",
    subtitle: "Αναδίπλωση των Περσών",
    desc: "Ο περσικός στόλος αποσύρεται από το Αιγαίο.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "489 π.Χ.",
    subtitle: "Το τέλος της αθηναϊκής αντεπίθεσης",
    desc: "Ο Μιλτιάδης ως στρατηγός της Αθήνας αποτυγχάνει να καταλάβει την Πάρο.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "486 π.Χ.",
    subtitle: "Ένας νέος Μεγάλος Βασιλέας",
    desc: "Θάνατος του Δαρείου Α΄. Τον διαδέχεται ένας από τους γιους του με το όνομα Ξέρξης Α΄. Αυτός είναι αποφασισμένος να συνεχίσει την πολιτική του πατέρα του.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "485 - 481 π.Χ.",
    subtitle: "Εσωτερικές εξελίξεις στην Ελλάδα",
    desc: "Σύγκρουση της Αθήνας με την Αίγινα.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "483 π.Χ.",
    subtitle: "Η ναυτική προετοιμασία της Αθήνας και διπλωματικές εξελίξεις",
    desc: "Ναυτικός νόμος του Θεμιστοκλή όπου τα κέρδη από την πρώτη φλέβα αργύρου που ανακαλύφθηκε στο Λαύριο διοχετεύονται στην κατασκευή τριήρεων. Κατασκευή του οχυρού λιμανιού στον Πειραιά. Οι Αλευάδες, αρχοντική οικογένεια η οποία ελέγχει την πόλη Λάρισα στη Θεσσαλία, έρχεται σε συμφωνία με τους Πέρσες.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "481 π.Χ. - Φθινόπωρο",
    subtitle: "Αρχή της εισβολής του Ξέρξη",
    desc: "Συγκέντρωση του περσικού στρατού στις Σάρδεις υπό διοίκηση του ίδιου του Ξέρξη. Στέλνονται εκ νέου πρέσβεις στις ελληνικές πόλεις. Δημιουργείται μία πανελλήνια συμμαχία με επικεφαλής τη Σπάρτη. Η Αθήνα και η Αίγινα συνάπτουν ειρήνη. Στέλνεται πρεσβεία στον τύραννο των Συρακουσών Γέλωνα στη Σικελία ζητώντας βοήθεια, χωρίς όμως αποτέλεσμα. Ειρήνη μεταξύ Σπάρτης και Άργους.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "480 π.Χ. - Άνοιξη",
    subtitle: "Οι Έλληνες ενώνονται μπροστά στον περσικό κίνδυνο",
    desc: "Επίσημη δημιουργία μιας πανελλήνιας συμμαχίας με κέντρο το Ιερό του Ισθμού στην Κόρινθο. Ο περσικός στρατός βρίσκεται στον Ελλήσποντο.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "480 π.Χ. - Ιούνιος",
    subtitle: "Ο Ξέρξης πλησιάζει",
    desc: "Ο Ξέρξης περνά τον Ελλήσποντο και μέσω Θράκης και Μακεδονίας βαδίζει προς την κυρίως Ελλάδα. Οι ελληνικές πόλεις συνεδριάζουν στον Ισθμό και κηρύσσουν ειρήνη μεταξύ τους και επιστροφή των εξόριστων.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "480 π.Χ. - Αύγουστος",
    subtitle: "Θερμοπύλες",
    desc: "Μετά από μία αποτυχημένη προσπάθεια των Ελλήνων να σταματήσουν τον Ξέρξη στα Τέμπη της Θεσσαλίας ο βασιλέας της Σπάρτης Λεωνίδας καταλαμβάνει το στενό των Θερμοπυλών , ενώ ο ενωμένος ελληνικός στόλος πλέει προς τη Σκιάθο. Σχεδόν ταυτόχρονη διεξαγωγή της ναυμαχίας του Αρτεμισίου και της μάχης στις Θερμοπύλες. Αν και στη θάλασσα το αποτέλεσμα είναι αμφίρροπο, στις Θερμοπύλες παρά τις αρχικές επιτυχίες, ο Λεωνίδας υπερφαλαγγίζεται. Τόσο ο ίδιος όσο και υπερασπιστές του στενού πολεμούν μέχρι ενός. Προέλαση του Ξέρξη στη Φωκίδα. Ο ελληνικός στόλος αποσύρεται. Οι Έλληνες αποφασίζουν να οχυρωθούν στον Ισθμό και οι Αθηναίοι να εγκαταλείψουν την πόλη τους.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "480 π.Χ. - Σεπτέμβριος",
    subtitle: "Η ναυμαχία της Σαλαμίνας",
    desc: "Ο Ξέρξης εισέρχεται στην Αθήνα η οποία πυρπολείται σε αντίποινα για την πυρπόληση των Σάρδεων. Λαμβάνει χώρα η ναυμαχία στη Σαλαμίνα. Η καταστροφή του περσικού ναυτικού αλλάζει τα δεδομένα της εκστρατείας.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "480 π.Χ. - Οκτώβριος",
    subtitle: "Ο Ξέρξης εγκαταλείπει την Ελλάδα",
    desc: "Ο περσικός στόλος αναδιπλώνεται στη Μικρά Ασία ενώ ο Ξέρξης επιστρέφει στην Ανατολή. Ο περσικός στρατός όμως αποσύρεται για τον χειμώνα στη Θεσσαλία με επικεφαλής τον Μαρδόνιο, γαμπρό του Ξέρξη.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "479 π.Χ. - Άνοιξη",
    subtitle: "Οι Έλληνες αρχίζουν αντεπίθεση",
    desc: "Ο ελληνικός στόλος συγκεντρώνεται στην Αίγινα και πλέει προς τη Δήλο.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "479 π.Χ. - Ιούνιος",
    subtitle:
      "Ο Περσικός στρατός επιχειρεί εναντίον της Βοιωτίας και της Ατικής",
    desc: "Ο Μαρδόνιος εισβάλλει στη Βοιωτία, την οποία μετατρέπει σε στρατηγείο του. Η Αθήνα για μία ακόμα φορά εγκαταλείπεται, καταλαμβάνεται και καταστρέφεται. Ο ελληνικός στρατός αρχίζει να συγκεντρώνεται στη Βοιωτία.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "479 π.Χ. - Ιούλιος-Αύγουστος",
    subtitle: "Ελληνικές ναυτικές επιτυχίες",
    desc: "Ο ελληνικός στόλος απελευθερώνει τη Χίο τη Σάμο και τη Λέσβο.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "479 π.Χ. - Σεπτέμβριος",
    subtitle: "Η μάχη των Πλαταιών και η μάχη της Μυκάλης",
    desc: "Νίκη των Ελλήνων στις Πλαταιές εναντίον του Μαρδόνιου. Αυτός χάνει τη ζωή του, ενώ τα υπολείμματα του στρατού του υποχωρούν άτακτα προς τον Ελλήσποντο. Στη Μικρά Ασία ο ελληνικός στόλος κατανικά ένα μέρος του περσικού στόλου οχυρωμένου στο ακρωτήριο της Μυκάλης.",
    img: "transparent.png",
    Μέγεθος: "",
  },
  {
    title: "479 π.Χ. - Φθινόπωρο",
    subtitle: "Κατάληψη της Σηστού",
    desc: "Παρά το ότι η Σπάρτη αποχωρεί από τη διοίκηση του ενωμένου ελληνικού στόλου, οι Αθηναίοι παραμένουν εν δράσει και προχωρούν προς τον Ελλήσποντο. Στη διαδρομή πολιορκούν και καταλαμβάνουν τη Σηστό. Οι Πέρσες έχουν εκδιωχτεί οριστικά από τον κυρίως ελλαδικό χώρο.",
    img: "transparent.png",
    Μέγεθος: "",
  },
];

const Home: NextPage = () => {
  const [info, setInfo] = useState(timeLine[0]);
  const router = useRouter();
  const [title, el] = info.title?.split("π.Χ.");
  return (
    <div className="w-screen   h-screen relative">
      <img
        src="/images/salamis.webp"
        className="object-cover w-full h-full absolute"
        alt=""
      />
      <div className="w-screen flex justify-center items-center h-screen bg-black z-50 flex-col absolute bg-opacity-60">
        <div
          key={info.desc}
          className="flex border border-white  border-opacity-10 rounded overflow-hidden shadow bg-black bg-opacity-30 w-4/6 my-auto text-white md:text-xl text-sm"
        >
          <motion.img
            transition={{ delay: 0.2 }}
            animate={{
              translateX: [-50, 0],
              opacity: [0, 1],
            }}
            className={clsx(
              " overflow-hidden object-cover h-[600px] border-r border-white border-opacity-20 ",
              {
                "w-[800px]": info.img !== "transparent.png",
                "w-40": info.img === "transparent.png",
              }
            )}
            src={`/images/${info.img}`}
          />
          <div className=" w-full px-8 py-8">
            <div className="flex items-end mr-3 text-orange-400">
              <motion.h1
                key={info.title}
                animate={{
                  translateY: [50, 0],
                  opacity: [0, 1],
                }}
                className="text-7xl  font-bold"
              >
                {title}
              </motion.h1>
              <motion.span
                transition={{
                  delay: 0.3,
                }}
                animate={{
                  translateY: [-150, 0],
                  opacity: [0, 1],
                }}
                className="text-3xl ml-2"
              >
                π.Χ.
                {el.replace("-", "")}
              </motion.span>
            </div>
            <div className="border-b border-orange-400 border-opacity-50 my-5" />
            <div className="h-96 overflow-y-auto overflow-x-hidden">
              <motion.div
                transition={{ delay: 0.6 }}
                animate={{
                  translateX: [100, 0],
                  opacity: [0, 1],
                }}
                className="text-xl text-gray-300"
              >
                <div className="mb-2 text-gray-400 text-sm">
                  {info.subtitle}:
                </div>
                <div className="mb-4 text-gray-200">
                  {info.desc} {el}
                </div>
              </motion.div>
            </div>
          </div>
        </div>
        <div className="overflow-x-scroll whitespace-nowrap w-screen">
          {timeLine.map((obj, idx) => (
            <Card
              onClick={() => {
                router.push({
                  query: {
                    period: obj.title,
                  },
                });
                setInfo(obj);
              }}
              time={obj.title}
              desc={obj.subtitle}
              key={idx}
            />
          ))}
        </div>
      </div>
    </div>
  );
};

export default Home;
