import type { NextPage } from "next";
import { useRef, useState } from "react";
import { motion } from "framer-motion";

const Card = (props: { onClick: () => void; time: string; desc: string }) => {
  return (
    <motion.button
      onClick={props.onClick}
      className="min-w-fit m-5 select-none relative"
    >
      <div className="w-80 h-40 overflow-hidden">
        <img
          draggable={false}
          src="https://picsum.photos/seed/1/2000/1000"
          className="z-50 rounded-xl brightness-75"
        />
        <div className="flex bg-black  bg-opacity-40 h-full flex-col absolute top-0 left-0 p-2 ">
          <div className="text-xl h-10 text-left text-white font-bold ">
            {props.time}
          </div>
          <div className="text-sm mt-auto text-white line-clamp-2 text-left ">
            {props.desc}
          </div>
        </div>
      </div>
    </motion.button>
  );
};

const timeLine = [
  {
    time: `550 Ο Κύρος Β΄ (ο Μέγας)`,
    desc: `Ο Κύρος Β΄ (ο Μέγας) καταλύει το κράτος των Μήδων στους οποίους ο λαός του, οι Πέρσες
    ήταν υποτελείς, δημιουργώντας ένα ανεξάρτητο βασίλειο.`,
  },

  {
    time: `547: Υποταγή Λυδίας`,
    desc: `Ο Κύρος Β΄ υποτάσσει το βασίλειο της Λυδίας υπό τον βασιλιά Κροίσο, το οποίο βρίσκεται
    στη δυτική Μικρά Ασία. Μαζί με αυτό, υποτάσσονται στον Πέρση βασιλέα και οι ελληνικές
    πόλεις των δυτικών παραλίων της Μικράς Ασίας, κτήσεις προηγουμένως της Λυδίας. Μαζί
    με αυτές υποτάσσονται τα νησιά του Αιγαίου στα ανοιχτά της μικρασιατικής παραλίας και η
    Φοινίκη.`,
  },

  {
    time: `540-539: Κατάλυση Βαβυλώνας`,
    desc: `Ο Κύρος Β΄ καταλύει τη Βαβυλώνα, το τελευταίο μεγάλο ανεξάρτητο βασίλειο της Ανατολής.`,
  },

  {
    time: `529: Αλλαγή εξουσίας στην Περσία`,
    desc: `Θάνατος του Κύρου. Τον διαδέχεται ο γιος του Καμβύσης.`,
  },

  {
    time: `525-523: Η Περσία εξαπλώνεται προς τα δυτικά`,
    desc: `Ο Καμβύσης συνεχίζει τις κατακτήσεις. Η Κύπρος, η Αίγυπτος και η Κυρηναϊκή περνούν στην περσική κυριαρχία.`,
  },

  {
    time: `522: Αναταραχές στην περσική αυτοκρατορία`,
    desc: `Ξαφνικός θάνατος του Καμβύση. Δυναστικές συγκρούσεις  και άνοδος του Δαρείου Α΄ στον θρόνο. Παρουσιάζεται ως συγγενής του Κύρου Β΄ μέσω ενός κοινού τους προγόνου, του Αχαιμένη. Από τότε η αυτοκρατορία των Περσών ονομάζεται Αχαιμενιδική.`,
  },

  {
    time: `513: Οι Πέρσες στην Ευρώπη`,
    desc: `Ο Δαρείος Α΄ εκστρατεύει στη Θράκη, όντας ο πρώτος ηγεμόνας της Ανατολής που δραστηριοποιείται στρατιωτικά σε ευρωπαϊκό έδαφος.`,
  },

  {
    time: `512: Η σατραπεία της Θράκης`,
    desc: `Παρά την υποχώρηση του Δαρείου και την ήττα του στη Σκυθία πέρα από τον Ίστρο (σημ. Δούναβη), δημιουργείται η σατραπεία της Θράκης , την υποταγή όλων των ελληνικών πόλεων της περιοχής ( Βυζάντιο, Χαλκηδόνα Άντανδρο, Λαμπώνιο και τα νησιά Λήμνος και Ίμβρος) αλλά και του βασιλείου της Μακεδονίας. Τα σύνορα της αυτοκρατορίας των Αχαιμενιδών φτάνουν πλέον στον Ίστρο και τον Στρυμόνα.`,
  },
  {
    time: `499-494: Ιωνική επανάσταση`,
    desc: `Οι ιωνικές ελληνικές πόλεις της δυτικής Μικράς Ασίας εξεγείρονται εναντίον των Περσών. Στη συνδρομή που ζήτησαν από τους Έλληνες της κυρίως Ελλάδας ανταποκρίθηκαν η Αθήνα και Ερέτρια. Το εκστρατευτικό σώμα των Αθηναίων κατάφερε να καταλάβει και να πυρπολήσει τις Σάρδεις, το κέντρο διοίκησης των Περσών στην ευρύτερη περιοχή της Μικράς Ασίας.
    Κατά τον Ηρόδοτο, η αθηναϊκή συμμετοχή στην εξέγερση των Ιώνων υπήρξε η αιτία των Μηδικών πολέμων. Νεότεροι ιστορικοί, ωστόσο, έδωσαν μεγαλύτερη έμφαση στην επεκτατική φιλοδοξία του Μεγάλου Βασιλέα και στην επιθυμία του να αποκλείσει μία νέα εξέγερση, εξουδετερώνοντας τις πόλεις της κυρίως Ελλάδας που βοήθησαν τους Ίωνες. Τελευταία, από ορισμένους μελετητές έχει δοθεί περισσότερη έμφαση στις δολοπλοκίες των Ελλήνων που είχαν καταφύγει στην περσική αυλή και υπέθαλψαν την περσική επιθετικότητα για προσωπικό τους όφελος. Η τελική άρνηση των Αθηναίων και των Σπαρτιατών να δώσουν "γην και ύδωρ" στους πρέσβεις των Περσών προκάλεσε την εισβολή του 490 π.Χ., η οποία κατέληξε στη μάχη του Μαραθώνα..`,
  },
  {
    time: `493: Το τέλος των αναταραχών`,
    desc: `Οριστική καταστολή της εξέγερσης από τους Πέρσες.`,
  },
  {
    time: `492: Η επανεμφάνιση των Περσών στη Θράκη`,
    desc: `Ο Πέρσης στρατηγός Μαρδόνιος εκστρατεύει στη Θράκη. Αποκαθιστά την περσική εξουσία στη Θάσο και τη Μακεδονία. Όμως ένα μεγάλο μέρος του στόλου του καταστρέφεται από τρικυμία στα ανοιχτά του όρους Άθω και η εκστρατεία τερματίζεται. Ο Αθηναίος τύραννος της Χερσονήσου Μιλτιάδης επιστρέφει στην Αθήνα διωγμένος από τους Πέρσες.`,
  },
  {
    time: `491: Αρχή του πολέμου`,
    desc: `Ο Δαρείος στελνει απεσταλμένους στις ελληνικές πόλεις ζητώντας υποταγή. Αν και η Αθήνα και η Σπάρτη αρνούνται σθεναρά, άλλες πόλεις, όπως η Αίγινα δέχονται την υποταγή.`,
  },
  {
    time: `490:  1ος «Μηδικός πόλεμος» Άνοιξη:`,
    desc: `Άφιξη του περσικού στόλου στο Αιγαίο πέλαγος υπό τους Δάτη και Αρταφέρνη. Την εκστρατεία συνοδεύει και ο εξόριστος τύραννος των Αθηνών Ιππίας. Ο βασιλέας της Σπάρτης Κλεομένης επεμβαίνει μετά από αίτημα της Αθήνας στην Αίγινα και αποτρέπει την υποταγή της στους Πέρσες.`,
  },
  {
    time: `490 Σεπτέμβριος: Μαραθώνας`,
    desc: `Περσική απόβαση στον Μαραθώνα και πάλι ως αντίποινα για τη συμμετοχή της Αθήνας στην Ιωνική εξέγερση. Νίκη Αθηναίων και Πλαταιών. Οι Αθηναίοι έχουν ως επικεφαλής στρατηγό τον διωγμένο από την Χερσόνησο Μιλτιάδη.  Αποτυχία των Περσών να καταλάβουν το Φάληρο. 
    Από άποψη στρατηγικής η πεδιάδα του Μαραθώνα, αν και ευνοούσε το περσικό ιππικό, επέτρεπε συγχρόνως και την ανάπτυξη της αθηναϊκής φάλαγγας, που έδωσε στους Έλληνες την τελική νίκη. Μετά την πρώτη επίθεση των Περσών, το κέντρο της παράταξης των Αθηναίων αρχικά υποχώρησε. Οι πλευρικές δυνάμεις, όμως, των Ελλήνων περικύκλωσαν το κέντρο και ανέτρεψαν την αρνητική πορεία της μάχης. Οι Πέρσες προβάλλοντας ισχυρή αντίσταση υποχώρησαν προς την παραλία και αποβιβάστηκαν στα πλοία που απειλούσαν να τα κάψουν οι Έλληνες. Οι Πέρσες παρά τις απώλειές τους κατευθύνθηκαν στο Φάληρο, με σκοπό να αποβιβαστούν, πριν επιστρέψουν οι Αθηναίοι. Καθώς ο Μιλτιάδης, όμως, πρόλαβε να φτάσει στην Αθήνα πριν τη δύση του ηλίου και να παρατάξει το στρατό του στην πεδιάδα του Φαλήρου, ο περσικός στόλος αποχώρησε.`,
  },

  {
    time: `490 Φθινόπωρο: Αναδίπλωση των Περσών`,
    desc: `Ο περσικός στόλος αποσύρεται από το Αιγαίο`,
  },

  {
    time: `489: Το τέλος της αθηναϊκής αντεπίθεσης`,
    desc: `Ο Μιλτιάδης ως στρατηγός της Αθήνας αποτυγχάνει να καταλάβει την Πάρο. `,
  },

  {
    time: `486: Ένας νέος Μεγάλος Βασιλέας`,
    desc: `Θάνατος του Δαρείου Α΄. Τον διαδέχεται ένας από τους γιους του με το όνομα Ξέρξης Α΄. Αυτός είναι αποφασισμένος να συνεχίσει την πολιτική του πατέρα του. `,
  },

  {
    time: `485-481: Εσωτερικές εξελίξεις στην Ελλάδα`,
    desc: `Σύγκρουση της Αθήνας με την Αίγινα`,
  },

  {
    time: `483: Η ναυτική προετοιμασία της Αθήνας και διπλωματικές εξελίξεις`,
    desc: `Ναυτικός νόμος του Θεμιστοκλή όπου τα κέρδη από την πρώτη φλέβα αργύρου που ανακαλύφθηκε στο Λαύριο διοχετεύονται στην κατασκευή τριήρεων. Κατασκευή του οχυρού λιμανιού στον Πειραιά. Οι Αλευάδες, αρχοντική οικογένεια η οποία ελέγχει την πόλη Λάρισα στη Θεσσαλία, έρχεται σε συμφωνία με τους Πέρσες.`,
  },

  {
    time: `481: Αρχή της εισβολής του Ξέρξη`,
    desc: `Φθινόπωρο: Συγκέντρωση του περσικού στρατού στις Σάρδεις υπό διοίκηση του ίδιου του Ξέρξη. Στέλνονται εκ νέου πρέσβεις στις ελληνικές πόλεις. Δημιουργείται μία πανελλήνια συμμαχία με επικεφαλής τη Σπάρτη. Η Αθήνα και η Αίγινα συνάπτουν ειρήνη. Στέλνεται πρεσβεία στον τύραννο των Συρακουσών Γέλωνα στη Σικελία ζητώντας βοήθεια, χωρίς όμως αποτέλεσμα. Ειρήνη μεταξύ Σπάρτης και Άργους. `,
  },

  {
    time: `480 Άνοιξη: Οι Έλληνες ενώνονται μπροστά στον περσικό κίνδυνο`,
    desc: `Επίσημη δημιουργία μιας πανελλήνιας συμμαχίας με κέντρο το Ιερό του Ισθμού στην Κόρινθο. Ο περσικός στρατός βρίσκεται στον Ελλήσποντο.`,
  },

  {
    time: `480 Ιούνιος: Ο Ξέρξης πλησιάζει`,
    desc: ` Ο Ξέρξης περνά τον Ελλήσποντο και μέσω Θράκης και Μακεδονίας βαδίζει προς την κυρίως Ελλάδα. Οι ελληνικές πόλεις συνεδριάζουν στον Ισθμό και κηρύσσουν ειρήνη μεταξύ τους και επιστροφή των εξόριστων. `,
  },

  {
    time: `480 Αύγουστος: Θερμοπύλες`,
    desc: `Μετά από μία αποτυχημένη προσπάθεια των Ελλήνων να σταματήσουν τον Ξέρξη στα Τέμπη της Θεσσαλίας ο βασιλέας της Σπάρτης Λεωνίδας καταλαμβάνει το στενό των Θερμοπυλών , ενώ ο ενωμένος ελληνικός στόλος πλέει προς τη Σκιάθο. Σχεδόν ταυτόχρονη διεξαγωγή της ναυμαχίας του Αρτεμισίου και της μάχης στις Θερμοπύλες. Αν και στη θάλασσα το αποτέλεσμα είναι αμφίρροπο, στις Θερμοπύλες παρά τις αρχικές επιτυχίες, ο Λεωνίδας υπερφαλαγγίζεται. Τόσο ο ίδιος όσο και υπερασπιστές του στενού πολεμούν μέχρι ενός. Προέλαση του Ξέρξη στη Φωκίδα. Ο ελληνικός στόλος αποσύρεται. Οι Έλληνες αποφασίζουν να οχυρωθούν στον Ισθμό και οι Αθηναίοι να εγκαταλείψουν την πόλη τους.`,
  },

  {
    time: `480 Σεπτέμβριος: Η ναυμαχία της Σαλαμίνας`,
    desc: `Ο Ξέρξης εισέρχεται στην Αθήνα η οποία πυρπολείται σε αντίποινα για την πυρπόληση των Σάρδεων. Λαμβάνει χώρα η ναυμαχία στη Σαλαμίνα. Η καταστροφή του περσικού ναυτικού αλλάζει τα δεδομένα της εκστρατείας. `,
  },

  {
    time: `480 Οκτώβριος: Ο Ξέρξης εγκαταλείπει την Ελλάδα`,
    desc: `Ο περσικός στόλος αναδιπλώνεται στη Μικρά Ασία ενώ ο Ξέρξης επιστρέφει στην Ανατολή. Ο περσικός στρατός όμως αποσύρεται για τον χειμώνα στη Θεσσαλία με επικεφαλής τον Μαρδόνιο, γαμπρό του Ξέρξη. `,
  },

  {
    time: `479 Άνοιξη: Οι Έλληνες αρχίζουν αντεπίθεση`,
    desc: `Ο ελληνικός στόλος συγκεντρώνεται στην Αίγινα και πλέει προς τη Δήλο. `,
  },

  {
    time: `479 Ιούνιος: Ο Περσικός στρατός επιχειρεί εναντίον της Βοιωτίας και της Ατικής `,
    desc: `Ο Μαρδόνιος εισβάλλει στη Βοιωτία, την οποία μετατρέπει σε στρατηγείο του. Η Αθήνα για μία ακόμα φορά εγκαταλείπεται, καταλαμβάνεται και καταστρέφεται. Ο ελληνικός στρατός αρχίζει να συγκεντρώνεται στη Βοιωτία.`,
  },

  {
    time: `479 Ιούλιος – Αύγουστος: Ελληνικές ναυτικές επιτυχίες`,
    desc: `Ο ελληνικός στόλος απελευθερώνει τη Χίο τη Σάμο και τη Λέσβο.`,
  },

  {
    time: `479 Σεπτέμβριος: Η μάχη των Πλαταιών και η μάχη της Μυκάλης`,
    desc: ` Νίκη των Ελλήνων στις Πλαταιές εναντίον του Μαρδόνιου. Αυτός χάνει τη ζωή του, ενώ τα υπολείμματα του στρατού του υποχωρούν άτακτα προς τον Ελλήσποντο. Στη Μικρά Ασία ο ελληνικός στόλος κατανικά ένα μέρος του περσικού στόλου οχυρωμένου στο ακρωτήριο της Μυκάλης. `,
  },

  {
    time: `479 Φθινόπωρο: Κατάληψη της Σηστού`,
    desc: `Παρά το ότι η Σπάρτη αποχωρεί από τη διοίκηση του ενωμένου ελληνικού στόλου, οι Αθηναίοι παραμένουν εν δράσει και προχωρούν προς τον Ελλήσποντο. Στη διαδρομή πολιορκούν και καταλαμβάνουν τη Σηστό. Οι Πέρσες έχουν εκδιωχτεί οριστικά από τον κυρίως ελλαδικό χώρο.`,
  },
];

const Home: NextPage = () => {
  const ref = useRef<HTMLDivElement>(null);
  const [info, setInfo] = useState(timeLine[0]);
  return (
    <div className="w-screen  h-screen relative">
      <img
        src="/images/salamis.webp"
        className="object-cover w-full h-full absolute"
        alt=""
      />
      <div className="w-screen h-screen bg-black z-50 flex flex-col absolute bg-opacity-60">
        <div className="md:w-1/2 w-full md:pt-20 md:pl-10 p-5">
          <motion.h1
            key={info.time}
            animate={{
              translateX: [50, 0],
              opacity: [0, 1],
            }}
            className="md:text-7xl text-4xl font-bold text-white"
          >
            {info.time}
          </motion.h1>
          <br />
          <motion.p
            key={info.desc}
            transition={{ delay: 0.2 }}
            animate={{
              translateY: [50, 0],
              opacity: [0, 1],
            }}
            className="text-white md:text-xl text-sm"
          >
            {info.desc}
          </motion.p>
        </div>
        <div
          ref={ref}
          className="flex duration-200 w-full justify-start bg-black bg-opacity-75 mt-auto overflow overflow-auto  mx-auto "
        >
          {timeLine.map((obj, idx) => (
            <Card
              onClick={() => setInfo(obj)}
              time={obj.time}
              desc={obj.desc}
              key={idx}
            />
          ))}
        </div>
      </div>
    </div>
  );
};

export default Home;
